app/Controllers/AdminController.php


                if($prodSize == Null)
                {
                    $orderId = $this->history->insert([
                        'ProductID' => $productId,
                        'total_amount' => $totalPrice,
                        'quantity' => $totalquantity,
                        'amount_paid' => $amountPaid,
                        'change_amount' => $change,
                        'size'  => 'Regular',
                        'orderCode' => 'CrDSPOS-' .$orderCode
                    ]);
---
INSERT INTO `tbl_orders` (`ProductID`, `total_amount`, `quantity`, `amount_paid`, `change_amount`, `size`, `orderCode`) VALUES ('4', '148.00', '1', 200, '52.00', 'Regular', 'CrDSPOS-G89H11MVMV')

    public function FiterReport()
    {
        $toDate = $this->request->getVar('toDate');
        $fromDate = $this->request->getVar('fromDate');


        $data= [
            'notif' => $this->raw->where('stocks <=', '10')->where('stocks >=', '0')->where('item_categ', 'Raw Materials')->findAll(),
            'count' => $this->raw->select('Count(*) as notif')->where('stocks <=', '10')->where('stocks >=', '0')
            ->where('item_categ', 'Raw Materials')->first(),
            'report' => $this->history->select('tbl_orders.orderid, tbl_orders.CustomerID, tbl_orders.ProductID, tbl_orders.OrderID,
            tbl_orders.quantity, tbl_orders.size, tbl_orders.orderCode, tbl_orders.order_date, tbl_orders.total_amount,
            tbl_orders.amount_paid,tbl_orders.change_amount, product_tbl.prod_id, product_tbl.prod_name, product_tbl.prod_quantity,
            product_tbl.prod_mprice, product_tbl.prod_lprice, product_tbl.prod_categ,')
            ->join('product_tbl', 'product_tbl.prod_id = tbl_orders.ProductID')
            ->where('DATE(order_date) >=', $toDate)->where('DATE(order_date) <=', $fromDate)->findAll(),
---
SELECT `tbl_orders`.`orderid`, `tbl_orders`.`CustomerID`, `tbl_orders`.`ProductID`, `tbl_orders`.`OrderID`, `tbl_orders`.`quantity`, `tbl_orders`.`size`, `tbl_orders`.`orderCode`, `tbl_orders`.`order_date`, `tbl_orders`.`total_amount`, `tbl_orders`.`amount_paid`, `tbl_orders`.`change_amount`, `product_tbl`.`prod_id`, `product_tbl`.`prod_name`, `product_tbl`.`prod_quantity`, `product_tbl`.`prod_mprice`, `product_tbl`.`prod_lprice`, `product_tbl`.`prod_categ`
FROM `tbl_orders`
JOIN `product_tbl` ON `product_tbl`.`prod_id` = `tbl_orders`.`ProductID`
WHERE DATE(order_date) >= '2024-09-04'
AND DATE(order_date) <= '2024-10-03'
ORDER BY DATE(order_date) ASC