app/Controllers/UserController.php

    public function login()
    {
        $session = session();

        // Check if user is locked out
        if ($session->get('lockout_time') && time() < $session->get('lockout_time')) {
            $remainingLockoutTime = $session->get('lockout_time') - time();
            $remainingLockoutMinutes = ceil($remainingLockoutTime / 60);
            $session->setFlashdata('msg', "Too many login attempts. Please try again in $remainingLockoutMinutes Minutes.");
            return redirect()->to('/login');
        }

        // Clear lockout if time has passed
        if ($session->get('lockout_time') && time() >= $session->get('lockout_time')) {
            $session->remove('lockout_time');
            $session->remove('login_attempts');
        }

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $this->user->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'RenceVa27@gmail.com'
 LIMIT 1