app/Controllers/VisualizationController.php

 public function allChart() {


    $db = \Config\Database::connect();
    $requestData = $this->request->getJSON();

    $month = $this->request->getVar('month');
    $year = $this->request->getVar('year');

    if ($month == null || $year == null) {
        $month = date('n');
        $year = date('Y');
    }

    $daysInMonth = cal_days_in_month(CAL_GREGORIAN, $month, $year);

    $builder = $db->table('tbl_orders');
    $query = $builder->select("SUM(total_amount) as count, SUM(total_amount) as s, DAY(order_date) as day")
        ->where('MONTH(order_date)', $month)
        ->where('YEAR(order_date)', $year)
        ->groupBy('DAY(order_date)')
        ->orderBy('day', 'ASC')
        ->get();
    $record = $query->getResult();
---
SELECT SUM(total_amount) as count, SUM(total_amount) as s, DAY(order_date) as day
FROM `tbl_orders`
WHERE MONTH(order_date) = '10'
AND YEAR(order_date) = '2024'
GROUP BY DAY(order_date)
ORDER BY `day` ASC

        ->groupBy('MONTH(order_date)')
        ->orderBy('month', 'ASC')
        ->get();
    $ByMonth = $query->getResult();
---
SELECT SUM(total_amount) as total_sales, MONTH(order_date) as month
FROM `tbl_orders`
WHERE MONTH(order_date) = '10'
AND YEAR(order_date) = '2024'
GROUP BY MONTH(order_date)
ORDER BY `month` ASC

        ->groupBy('MONTH(order_date)')
        ->orderBy('month', 'ASC')
        ->get();
    $salesByMonth = $query->getResult();
---
SELECT YEAR(order_date) as year, SUM(total_amount) as total_amount
FROM `tbl_orders`
WHERE YEAR(order_date) = '2024'
GROUP BY YEAR(order_date)
SELECT SUM(total_amount) as total_sales, MONTH(order_date) as month
FROM `tbl_orders`
WHERE YEAR(order_date) = '2024'
GROUP BY MONTH(order_date)
ORDER BY `month` ASC