app/Models/AdminUserModel.php

SELECT *
FROM `user`
WHERE `UserRole` = 'Admin'
---
    public function adminuser($role)
    {
        return $this->where('UserRole', $role)->findAll();